In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("dataset_Facebook.csv", delimiter=";")

In [3]:
df.head()

,Page total likes,Type,Category,Post Month,Post Weekday,Post Hour,Paid,Lifetime Post Total Reach,Lifetime Post Total Impressions,Lifetime Engaged Users,Lifetime Post Consumers,Lifetime Post Consumptions,Lifetime Post Impressions by people who have liked your Page,Lifetime Post reach by people who like your Page,Lifetime People who have liked your Page and engaged with your post,comment,like,share,Total Interactions
0,139441,Photo,2,12,4,3,0.0,2752,5091,178,109,159,3078,1640,119,4,79.0,17.0,100
1,139441,Status,2,12,3,10,0.0,10460,19057,1457,1361,1674,11710,6112,1108,5,130.0,29.0,164
2,139441,Photo,3,12,3,3,0.0,2413,4373,177,113,154,2812,1503,132,0,66.0,14.0,80
3,139441,Photo,2,12,2,10,1.0,50128,87991,2211,790,1119,61027,32048,1386,58,1572.0,147.0,1777
4,139441,Photo,2,12,2,3,0.0,7244,13594,671,410,580,6228,3200,396,19,325.0,49.0,393

In [4]:
df.shape

(500, 19)

In [6]:
df.isnull().sum

<bound method DataFrame.sum of      Page total likes   Type  Category  Post Month  Post Weekday  Post Hour  \
0               False  False     False       False         False      False
1               False  False     False       False         False      False
2               False  False     False       False         False      False
3               False  False     False       False         False      False
4               False  False     False       False         False      False
..                ...    ...       ...         ...           ...        ...
495             False  False     False       False         False      False
496             False  False     False       False         False      False
497             False  False     False       False         False      False
498             False  False     False       False         False      False
499             False  False     False       False         False      False

      Paid  Lifetime Post Total Reach  Lifetime Post Total Impressions  \
0    False                      False                            False
1    False                      False                            False
2    False                      False                            False
3    False                      False                            False
4    False                      False                            False
..     ...                        ...                              ...
495  False                      False                            False
496  False                      False                            False
497  False                      False                            False
498  False                      False                            False
499   True                      False                            False

     Lifetime Engaged Users  Lifetime Post Consumers  \
0                     False                    False
1                     False                    False
2                     False                    False
3                     False                    False
4                     False                    False
..                      ...                      ...
495                   False                    False
496                   False                    False
497                   False                    False
498                   False                    False
499                   False                    False

     Lifetime Post Consumptions  \
0                         False
1                         False
2                         False
3                         False
4                         False
..                          ...
495                       False
496                       False
497                       False
498                       False
499                       False

     Lifetime Post Impressions by people who have liked your Page  \
0                                                False
1                                                False
2                                                False
3                                                False
4                                                False
..                                                 ...
495                                              False
496                                              False
497                                              False
498                                              False
499                                              False

     Lifetime Post reach by people who like your Page  \
0                                               False
1                                               False
2                                               False
3                                               False
4                                               False
..                                                ...
495                                             False
496                                             False
497                                             False
498                                             False
499                                             False

     Lifetime People who have liked your Page and engaged with your post  \
0                                                False
1                                                False
2                                                False
3                                                False
4                                                False
..                                                 ...
495                                              False
496                                              False
497                                              False
498                                              False
499                                              False

     comment   like  share  Total Interactions
0      False  False  False               False
1      False  False  False               False
2      False  False  False               False
3      False  False  False               False
4      False  False  False               False
..       ...    ...    ...                 ...
495    False  False  False               False
496    False  False  False               False
497    False  False  False               False
498    False  False  False               False
499    False  False  False               False

[500 rows x 19 columns]>

In [7]:
subset1 = df[['Type', 'Category', 'Post Month']]
subset2 = df[['Type', 'Category', 'comment']]

subset1.head()

     Type  Category  Post Month
0   Photo         2          12
1  Status         2          12
2   Photo         3          12
3   Photo         2          12
4   Photo         2          12

In [8]:
subset2.head()

     Type  Category  comment
0   Photo         2        4
1  Status         2        5
2   Photo         3        0
3   Photo         2       58
4   Photo         2       19

In [9]:
merged = pd.merge(subset1, subset2, on=['Type', 'Category'])
merged.head()

    Type  Category  Post Month  comment
0  Photo         2          12        4
1  Photo         2          12       58
2  Photo         2          12       19
3  Photo         2          12        0
4  Photo         2          12        0

In [10]:
sorted_data = merged.sort_values(by='comment', ascending=False)
sorted_data.head()

        Type  Category  Post Month  comment
24224  Photo         2           8      372
26909  Photo         2           8      372
30922  Photo         2           7      372
21550  Photo         2           9      372
41987  Photo         2           5      372

In [11]:
sorted_data = merged.sort_values(by='comment', ascending=False)
sorted_data.head()

        Type  Category  Post Month  comment
24224  Photo         2           8      372
26909  Photo         2           8      372
30922  Photo         2           7      372
21550  Photo         2           9      372
41987  Photo         2           5      372

In [12]:
merged.head().T

                0      1      2      3      4
Type        Photo  Photo  Photo  Photo  Photo
Category        2      2      2      2      2
Post Month     12     12     12     12     12
comment         4     58     19      0      0

In [13]:
df.shape, merged.shape

((500, 19), (66926, 4))

In [14]:
reshaped = pd.melt(df,
                   id_vars=['Type', 'Category'],
                   value_vars=['comment', 'like', 'share'],
                   var_name='Metric',
                   value_name='Count')
reshaped.head()

     Type  Category   Metric  Count
0   Photo         2  comment    4.0
1  Status         2  comment    5.0
2   Photo         3  comment    0.0
3   Photo         2  comment   58.0
4   Photo         2  comment   19.0

In [15]:
pivoted = reshaped.pivot_table(index=['Type', 'Category'],
                               columns='Metric',
                               values='Count',
                               aggfunc='mean')
pivoted.head()

Metric            comment        like      share
Type  Category
Link  1          2.900000   75.650000  12.700000
      2          2.000000   32.000000  15.000000
      3          2.000000   68.000000  15.000000
Photo 1          5.897297  126.000000  17.961326
      2         11.692308  235.857143  35.505495